AccountingRegisters/Налоговый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Налоговый</Name>
			<ChartOfAccounts>ChartOfAccounts.Налоговый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодразделения</Name>
					<Comment>TS</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШифрПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйКомитет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьРеквизитыГоловнойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяСтруктурнымПодразделением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестныйБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоМестнымБюджетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловноеОбозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БурениеСобственнымиСилами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЦФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаСО</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccountingRegisters/Налоговый/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи)
	
	Если ОбменДанными.Загрузка Тогда
		//Автономная работа: созданиче начального образа, исключения ошибки Запись не верна!
		//До изменении в механизмах платформы
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СозданиеНачальногоОбраза")
			ИЛИ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбработкаДанных") Тогда
			Для Каждого ТекЗапись Из ЭтотОбъект Цикл
				УстановитьЗначенияПоУмолчанию(ТекЗапись);
			КонецЦикла; 
		КонецЕсли; 	
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	КэшВидыСоставныхСубконто = Новый Соответствие;
	//СписокСчетовВА = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПолучитьСписокСчетовВАУчетаНУ();
	
	Для Каждого Проводка Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Проводка.ВидУчетаДт) ИЛИ НЕ ЗначениеЗаполнено(Проводка.ВидУчетаКт) Тогда
			ВидУчетаДт = Проводка.ВидУчетаДт;
			ВидУчетаКт = Проводка.ВидУчетаКт;			
			//ПроцедурыНалоговогоУчета.ВидУчетаНУ(Проводка, Проводка.Регистратор.ОтражатьВНалоговомУчете, Проводка.Регистратор.ВидУчетаНУ);
			Если (ЗначениеЗаполнено(ВидУчетаДт)) И
				(ЗначениеЗаполнено(Проводка.СчетДт)) Тогда
				Проводка.ВидУчетаДт = ВидУчетаДт;
			КонецЕсли;	
			Если (ЗначениеЗаполнено(ВидУчетаКт)) И
				(ЗначениеЗаполнено(Проводка.СчетКт))  Тогда
				Проводка.ВидУчетаКт = ВидУчетаКт;
			КонецЕсли;			
		КонецЕсли;
		
		ПривестиПустыеЗначенияСубконтоСоставногоТипа(Проводка, КэшВидыСоставныхСубконто);
		
		Если ЗначениеЗаполнено(Проводка.СтруктурноеПодразделениеДт) И ЗначениеЗаполнено(Проводка.СчетДт) Тогда
			
			Если ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.СчетЯвляетсяВАНУ(Проводка.СчетДт) Тогда 
				Проводка.СтруктурноеПодразделениеДт = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Проводка.СтруктурноеПодразделениеКт) И ЗначениеЗаполнено(Проводка.СчетКт) Тогда
			
			Если ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.СчетЯвляетсяВАНУ(Проводка.СчетКт) Тогда 
				Проводка.СтруктурноеПодразделениеКт = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Субконто составного типа

Процедура ПривестиПустыеЗначенияСубконтоСоставногоТипа(Проводка, КэшВидыСоставныхСубконто)
	
	Для Каждого Субконто Из Проводка.СубконтоДт Цикл
		
		Если НЕ ЗначениеЗаполнено(Субконто.Значение) 
			И Субконто.Значение <> Неопределено 
			И СоставнойТипСубконто(Субконто.Ключ, КэшВидыСоставныхСубконто) Тогда
			Проводка.СубконтоДт.Вставить(Субконто.Ключ, Неопределено);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Субконто Из Проводка.СубконтоКт Цикл
		
		Если НЕ ЗначениеЗаполнено(Субконто.Значение) 
			И Субконто.Значение <> Неопределено 
			И СоставнойТипСубконто(Субконто.Ключ, КэшВидыСоставныхСубконто) Тогда
			Проводка.СубконтоКт.Вставить(Субконто.Ключ, Неопределено);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоставнойТипСубконто(ВидСубконто, КэшВидыСоставныхСубконто)
	
	Составной = КэшВидыСоставныхСубконто.Получить(ВидСубконто);
	
	Если Составной = Неопределено Тогда
		Составной = ВидСубконто.ТипЗначения.Типы().Количество() > 1;
		КэшВидыСоставныхСубконто.Вставить(ВидСубконто, Составной);
	КонецЕсли;
	
	Возврат Составной;
	
КонецФункции

Процедура УстановитьЗначенияПоУмолчанию(СтрокаНабора)
	СвойстваСчетаДт = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаНабора.СчетДт);
	УстановитьЗначенияПоУмолчаниюДтКт(СтрокаНабора, СвойстваСчетаДт, "Дт");
	СвойстваСчетаКт = ПроцедурыБухгалтерскогоУчетаВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаНабора.СчетКт);
	УстановитьЗначенияПоУмолчаниюДтКт(СтрокаНабора, СвойстваСчетаКт, "Кт");
КонецПроцедуры

Процедура УстановитьЗначенияПоУмолчаниюДтКт(СтрокаНабора, СвойстваСчета, ДтКт)
	
	ПроверитьУстановленныеСубконто(СтрокаНабора, СвойстваСчета, ДтКт);
	
КонецПроцедуры

Процедура ПроверитьУстановленныеСубконто(СтрокаНабора, СвойстваСчета, ДтКт)

	ЗначенияСубконто = Новый Соответствие;
	Для каждого ВидСубконтоСчета Из СтрокаНабора["Субконто" + ДтКт] Цикл
		ЗначенияСубконто.Вставить(ВидСубконтоСчета.Ключ, ВидСубконтоСчета.Значение);
	КонецЦикла;
	
	СтрокаНабора["Субконто" + ДтКт].Очистить();
	
	Для НомерСубконто = 1 По СвойстваСчета.КоличествоСубконто Цикл
		ВидСубконто = СвойстваСчета["ВидСубконто" + НомерСубконто];
		ТипСубконто = СвойстваСчета["ВидСубконто" + НомерСубконто + "ТипЗначения"];
		Попытка
		СтрокаНабора["Субконто" + ДтКт].Вставить(
			ВидСубконто,
				ТипСубконто.ПривестиЗначение(ЗначенияСубконто.Получить(ВидСубконто)));
		Исключение
			Продолжить;				
		КонецПопытки;			
	КонецЦикла;    
	
КонецПроцедуры

#КонецЕсли
